jcip/html/build_blocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>构建模块</title>
<!-- 2016-11-13 Sun 23:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="klose" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">构建模块</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">同步集合类</a>
<ul>
<li><a href="#sec-1-1">同步集合类的问题</a></li>
<li><a href="#sec-1-2">ConcurrentModificationException　</a></li>
</ul>
</li>
<li><a href="#sec-2">并发集合类　</a>
<ul>
<li><a href="#sec-2-1">ConcurrentHashMap</a></li>
<li><a href="#sec-2-2">CopyOnWriteArrayList</a></li>
</ul>
</li>
<li><a href="#sec-3">BlockingQueue接口</a>
<ul>
<li><a href="#sec-3-1">常见实现类</a></li>
<li><a href="#sec-3-2">生产消费模式　</a></li>
</ul>
</li>
<li><a href="#sec-4">同步工具类</a>
<ul>
<li><a href="#sec-4-1">闭锁</a></li>
<li><a href="#sec-4-2">FutureTask</a></li>
<li><a href="#sec-4-3">Semphore</a></li>
<li><a href="#sec-4-4">栅栏</a></li>
</ul>
</li>
<li><a href="#sec-5">高效线程安全的缓存</a>
<ul>
<li><a href="#sec-5-1">使用HashMap做缓存</a></li>
<li><a href="#sec-5-2">使用ConcurrentHashMap避免加锁　</a></li>
<li><a href="#sec-5-3">缓存Future对象，返回该Future对象的get方法，如果实际的计算还在进行当中, get方法将被阻塞, 直到计算完成　</a></li>
<li><a href="#sec-5-4">使用putIfAbsent合并get,if,put这三个操作</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">同步集合类</h2>
<div class="outline-text-2" id="text-1">
<p>
java提供了多种synchronized集合, 比如Vector, HashTable, Collections的synchronizedXxx方法的返回值. 这些集合封装了状态变量，对每个public方法添加synchronized关键字
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">同步集合类的问题</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #7fffd4;">@NotThreadSafe</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">getLast</span>(<span style="color: #98fb98;">Vector</span> <span style="color: #eedd82;">list</span>) {   
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">lastIndex</span> = list.size() - 1;   
    <span style="color: #00ffff;">return</span> list.get(lastIndex);   
}   

<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">deleteLast</span>(<span style="color: #98fb98;">Vector</span> <span style="color: #eedd82;">list</span>) {   
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">lastIndex</span> = list.size() - 1;   
    list.remove(lastIndex);   
}
</pre>
</div>
<p>
假设Vector对象中含有10个元素, 多线程环境下可能出现这样的场景: 
线程1调用getLast方法, 计算得知lastIndex为9, 然后线程失去CPU使用权. 接着线程2调用deleteLast方法, 其lastIndex也为9, 线程2删除了第9个元素. 然后线程1重新获得CPU时间, 线程1会试图获取第9个元素, 但是该元素已经被线程2删除了, 此时将抛出ArrayIndexOutOfBoundsException异常
</p>

<p>
对于列表的复合操作仍然需要额外的同步保证原子性
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">ConcurrentModificationException　</h3>
<div class="outline-text-3" id="text-1-2">
<p>
迭代集合时, 每个集合内部都拥有一个名为modCount的成员变量, 如果集合发生了变化, 就会更改modCount的值. 使用Iterator开始迭代时，会将modCount的赋值给expectedModCount, 在迭代过程中, 通过每次比较两者是否相等来判断集合是否在内部或被其它线程修改. 如果expectedModCount和modCount不相等, 将抛出ConcurrentModificationException异常　
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">Iterator</span>&lt;<span style="color: #98fb98;">Integer</span>&gt; <span style="color: #eedd82;">it</span> = list.iterator();  
<span style="color: #00ffff;">while</span>(it.hasNext()) {  
    System.out.println(it.next());  
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">remove&#25805;&#20316;&#20250;&#23548;&#33268;modCount&#30340;&#20540;&#34987;&#20462;&#25913;, &#20174;&#32780;&#24341;&#21457;ConcurrentModificationException&#24322;&#24120;  </span>
    list.remove(0);  
}
</pre>
</div>

<ol class="org-ol">
<li>可以使用同步集合类
</li>
<li>先同步的clone一份集合然后对clone集合进行迭代, clone的过程仍然需要同步
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">ArrayList</span>&lt;<span style="color: #98fb98;">Integer</span>&gt; <span style="color: #eedd82;">listClone</span> = <span style="color: #7fffd4;">null</span>;  
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">clone&#26102;&#20381;&#28982;&#38656;&#35201;&#21516;&#27493;  </span>
<span style="color: #00ffff;">synchronized</span> (list) {  
    listClone = (<span style="color: #98fb98;">ArrayList</span>&lt;<span style="color: #98fb98;">Integer</span>&gt;) list.clone();  
}  
<span style="color: #98fb98;">Iterator</span>&lt;<span style="color: #98fb98;">Integer</span>&gt; <span style="color: #eedd82;">it</span> = listClone.iterator();  
<span style="color: #00ffff;">while</span> (it.hasNext()) {  
    doSomething(it.next());  
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">并发集合类　</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>ConcurrentHashMap代替散列Map
</li>
<li>CopyOnWriteArrayList代替同步List
</li>
<li>CopyOnWriteArraySet代替同步Set
</li>
<li>ConcurrentSkipListMap代替同步SortMap
</li>
<li>ConcurrentSkipListSet代替同步SortSet
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">ConcurrentHashMap</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>ConcurrentHashMap具有更好的并发性能. ConcurrentHashMap是线程安全的, 但是其同步策略和SynchronizedMap有很大不同. ConcurrentHashMap在read时几乎不用加锁, 而write时使用的是细粒度的分段锁, ConcurrentHashMap甚至可以做到并发write 
</li>
<li>由于ConcurrentHashMap的分段加锁机制, 使用ConcurrentHashMap类时, 调用方无法再自行加锁.
</li>
<li>由于调用方无法自行加锁, 因此ConcurrentHashMap类提供了一些常见的复合操作

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#21482;&#26377;key&#19981;&#26159;&#38598;&#21512;&#20013;&#30340;&#38190;&#26102;&#25165;&#25554;&#20837;&#35813;&#38190;&#20540;&#23545;</span>
<span style="color: #98fb98;">V</span> <span style="color: #87cefa;">putIfAbsent</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">value</span>); 
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#38598;&#21512;&#20013;&#23384;&#22312;&#35813;&#38190;&#20540;&#23545;&#26102;&#25165;&#21024;&#38500;</span>
<span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">remove</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">value</span>); 
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#21482;&#26377;key&#21644;oldValue&#26159;&#38598;&#21512;&#20013;&#30340;&#38190;&#20540;&#23545;&#26159;&#25165;&#36827;&#34892;&#26367;&#25442;</span>
<span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">replace</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">oldValue</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">newValue</span>); 
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#21482;&#26377;key&#26159;&#38598;&#21512;&#20013;&#30340;key&#26102;&#25165;&#36827;&#34892;&#26367;&#25442;</span>
<span style="color: #98fb98;">V</span> <span style="color: #87cefa;">replace</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">newValue</span>);
</pre>
</div>
</li>

<li>迭代时不需要调用方进行额外的同步. ConcurrentHashMap使用的迭代器被称为weakly consistent(弱一致)迭代器, 弱一致迭代器不会在迭代期间抛出ConcurrentModificationException异常. 迭代开始后, 如果其他线程删除了ConcurrentHashMap集合的某个元素, 且被删除的元素尚未由next方法返回, 则该元素就不会被迭代器返回给调用方. 如果迭代开始后其他线程往ConcurrentHashMap集合中插入了新的元素, 那么新的元素可能会也可能不会被返回给调用方. 无论如何, 弱一致迭代器都保证不会将同一个元素多次返回给调用方 
</li>
<li>调用ConcurrentHashMap对象的size, isEmpty等方法时(这些方法是针对整体Map的操作), 性能比较差. ConcurrentHashMap适合在要求高并发高性能的场合下使用, 在这些场景下, size或者isEmpty等方法用处不大, 这是可以接受的权衡
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">CopyOnWriteArrayList</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>CopyOnWriteArrayList是线程安全的, 且处理读操作不需要进行同步和加锁. 所以读操作具有很好的并发性
</li>
<li>CopyOnWriteArrayList的每次写操作都会把底层的数组进行拷贝，然后对拷贝数组进行修改，代价很高，CopyOnWriteArrayList只适用于读操作频率远远大于写操作频率的场景
</li>
<li>CopyOnWriteArrayList无法在调用方进行额外加锁. 同时CopyOnWriteArrayList也提供了一些常用的复合操作, 如putIfAbsent等 

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Insert into map only if no value is mapped from K</span>
<span style="color: #98fb98;">V</span> <span style="color: #87cefa;">putIfAbsent</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">value</span>);
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Remove only if K is mapped to V</span>
<span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">remove</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">value</span>);
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Replace value only if K is mapped to oldValue</span>
<span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">replace</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">oldValue</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">newValue</span>);
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Replace value only if K is mapped to some value</span>
<span style="color: #98fb98;">V</span> <span style="color: #87cefa;">replace</span>(<span style="color: #98fb98;">K</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">newValue</span>);
</pre>
</div>
</li>

<li>CopyOnWriteArrayList的迭代只能反应迭代开始时CopyOnWriteArrayList对象所持有的集合. 迭代期间不会抛出ConcurrentModificationException异常, 调用方不需要进行额外的加锁(实际上也没有进行)
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">BlockingQueue接口</h2>
<div class="outline-text-2" id="text-3">
<p>
BlockingQueue的容量可以是无限的, 也可以是有限的. 无限容量的BlockingQueue永远也不会发生队列已满的事件
</p>

<ul class="org-ul">
<li>put方法用于将数据放入队列, 如果队列已满, put方法所在的线程将阻塞, 直到队列不满 
</li>
<li>take方法用于从队列中取出数据, 如果队列为空, take方法所在的线程将阻塞, 直到队列不为空 
</li>
<li>offer用于将数据放入队列, 如果队列已满, 将最多等待指定的时间, offer返回true时说明数据成功入队, 否则说明没有成功
</li>
<li>poll用于从队列中取出数据, 如果队列为空, 最多等待指定的时间, poll返回值为null时说明没有取到数据
</li>
</ul>
</div>
