src/jcip/build_blocks.org
** 常见实现类 
+ ArrayBlockingQueue底层使用循环数组实现
+ LinkedBlockingQueue底层使用链表实现
+ PriorityBlockingQueue则是一个可排序的阻塞队列, 可以按照元素的自然顺序(元素需要实现Comparable接口)或者指定的Comparator排序 
+ SynchronousQueue不用保存元素到Queue，直接交付给消费线程
  
** 生产消费模式　
   生产者
   #+BEGIN_SRC java
      public class FileCrawler implements Runnable {
              private final BlockingQueue<File> fileQueue;
              private final FileFilter fileFilter;
              private final File root;
              ...
              public void run() {
                      try {
                              crawl(root);
                      } catch (InterruptedException e) {
                              Thread.currentThread().interrupt();
                      }
              }
              private void crawl(File root) throws InterruptedException {
                      File[] entries = root.listFiles(fileFilter);
                      if (entries != null) {
                              for (File entry : entries)
                                      if (entry.isDirectory())
                                              crawl(entry);
                                      else if (!alreadyIndexed(entry))
                                              fileQueue.put(entry);
                      }
              }
      }

   #+END_SRC
   
   消费者
   #+BEGIN_SRC java
  public class Indexer implements Runnable {
          private final BlockingQueue<File> queue;
          public Indexer(BlockingQueue<File> queue) {
                  this.queue = queue;
          }
          public void run() {
                  try {
                          while (true)
                                  indexFile(queue.take());
                  } catch (InterruptedException e) {
                          Thread.currentThread().interrupt();
                  }
          }
  }
   #+END_SRC
   主线程
   #+BEGIN_SRC java
  public static void startIndexing(File[] roots) {
          BlockingQueue<File> queue = new LinkedBlockingQueue<File>(BOUND);
          FileFilter filter = new FileFilter() {
                          public boolean accept(File file) { return true; }
                  };
          for (File root : roots)
                  new Thread(new FileCrawler(queue, filter, root)).start();
          for (int i = 0; i < N_CONSUMERS; i++)
                  new Thread(new Indexer(queue)).start();
  }
   #+END_SRC
   
* 同步工具类
** 闭锁
   闭锁相当于一个门, 当到达特定的状态之前, 门是关闭的, 此时所有线程将被阻塞, 只有到达了特定状态, 线程才能通过
1. 计算直到所有的资源初始化才开始计算
2. 服务直到依赖的服务启动完毕才启动
3. 会话直到所有的参加者都就绪才开始
CountDownLatch是闭锁的具体实现, CountDownLatch内部维护了一个计数器, 初始化CountDownLatch时需要指定计数器的初始值. 该初始值表示需要等待完成的事件的个数. 每调用一次countDown方法, 表示其中一个事件已经完成, 计数器的值将减一. 当计数器减为0时, 门才会打开

#+BEGIN_SRC java
  public long timeTasks(int nThreads, final Runnable task)
          throws InterruptedException {
          // startGate用来控制子线程，当所有的子线程准备就绪时候，主线程执行startGate的countDown操作，让子线程一起运行
          final CountDownLatch startGate = new CountDownLatch(1);
          //endGate用来控制主线程，每个子线程运行完毕后，对endGate执行countDown操作，当所有的子线程结束后，主线程恢复运行
          final CountDownLatch endGate = new CountDownLatch(nThreads);
          for (int i = 0; i < nThreads; i++) {
                  Thread t = new Thread() {
                                  @Override
                                  public void run() {
                                          try {
                                                  //n个线程通过start gate处于等待状态
                                                  startGate.await();
                                                  try {
                                                          task.run();
                                                  } finally {
                                                          endGate.countDown();
                                                  }
                                          } catch (InterruptedException ignored) {
                                          }
                                  }
                          };
                  t.start();
          }
          long start = System.nanoTime();
          //start gate开启，n个线程同时开始运行
          startGate.countDown();
          
          endGate.await();
          long end = System.nanoTime();
          return end - start;
  }
#+END_SRC
