jcip/html/build_blocks.html


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">常见实现类</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>ArrayBlockingQueue底层使用循环数组实现
</li>
<li>LinkedBlockingQueue底层使用链表实现
</li>
<li>PriorityBlockingQueue则是一个可排序的阻塞队列, 可以按照元素的自然顺序(元素需要实现Comparable接口)或者指定的Comparator排序 
</li>
<li>SynchronousQueue不用保存元素到Queue，直接交付给消费线程
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">生产消费模式　</h3>
<div class="outline-text-3" id="text-3-2">
<p>
生产者
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">FileCrawler</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Runnable</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">BlockingQueue</span>&lt;<span style="color: #98fb98;">File</span>&gt; <span style="color: #eedd82;">fileQueue</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">FileFilter</span> <span style="color: #eedd82;">fileFilter</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">File</span> <span style="color: #eedd82;">root</span>;
    ...
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> run() {
        <span style="color: #00ffff;">try</span> {
            crawl(root);
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">InterruptedException</span> <span style="color: #eedd82;">e</span>) {
            Thread.currentThread().interrupt();
        }
    }
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">crawl</span>(<span style="color: #98fb98;">File</span> <span style="color: #eedd82;">root</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {
        <span style="color: #98fb98;">File</span>[] <span style="color: #eedd82;">entries</span> = root.listFiles(fileFilter);
        <span style="color: #00ffff;">if</span> (entries != <span style="color: #7fffd4;">null</span>) {
            <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">File</span> <span style="color: #eedd82;">entry</span> : entries)
                <span style="color: #00ffff;">if</span> (entry.isDirectory())
                    crawl(entry);
                <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span> (!alreadyIndexed(entry))
                    fileQueue.put(entry);
        }
    }
}
</pre>
</div>

<p>
消费者
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Indexer</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Runnable</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">BlockingQueue</span>&lt;<span style="color: #98fb98;">File</span>&gt; <span style="color: #eedd82;">queue</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Indexer</span>(<span style="color: #98fb98;">BlockingQueue</span>&lt;<span style="color: #98fb98;">File</span>&gt; <span style="color: #eedd82;">queue</span>) {
        <span style="color: #00ffff;">this</span>.queue = queue;
    }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
        <span style="color: #00ffff;">try</span> {
            <span style="color: #00ffff;">while</span> (<span style="color: #7fffd4;">true</span>)
                indexFile(queue.take());
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">InterruptedException</span> <span style="color: #eedd82;">e</span>) {
            Thread.currentThread().interrupt();
        }
    }
}
</pre>
</div>
<p>
主线程
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">startIndexing</span>(<span style="color: #98fb98;">File</span>[] <span style="color: #eedd82;">roots</span>) {
    <span style="color: #98fb98;">BlockingQueue</span>&lt;<span style="color: #98fb98;">File</span>&gt; <span style="color: #eedd82;">queue</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">LinkedBlockingQueue</span>&lt;<span style="color: #98fb98;">File</span>&gt;(BOUND);
    <span style="color: #98fb98;">FileFilter</span> <span style="color: #eedd82;">filter</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">FileFilter</span>() {
            <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">accept</span>(<span style="color: #98fb98;">File</span> <span style="color: #eedd82;">file</span>) { <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">true</span>; }
        };
    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">File</span> <span style="color: #eedd82;">root</span> : roots)
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">FileCrawler</span>(queue, filter, root)).start();
    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = 0; i &lt; <span style="color: #98fb98;">N_CONSUMERS</span>; i++)
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Indexer</span>(queue)).start();
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">同步工具类</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">闭锁</h3>
<div class="outline-text-3" id="text-4-1">
<p>
闭锁相当于一个门, 当到达特定的状态之前, 门是关闭的, 此时所有线程将被阻塞, 只有到达了特定状态, 线程才能通过
</p>
<ol class="org-ol">
<li>计算直到所有的资源初始化才开始计算
</li>
<li>服务直到依赖的服务启动完毕才启动
</li>
<li>会话直到所有的参加者都就绪才开始
</li>
</ol>
<p>
CountDownLatch是闭锁的具体实现, CountDownLatch内部维护了一个计数器, 初始化CountDownLatch时需要指定计数器的初始值. 该初始值表示需要等待完成的事件的个数. 每调用一次countDown方法, 表示其中一个事件已经完成, 计数器的值将减一. 当计数器减为0时, 门才会打开
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #98fb98;">long</span> <span style="color: #87cefa;">timeTasks</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">nThreads</span>, <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Runnable</span> <span style="color: #eedd82;">task</span>)
    <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">startGate&#29992;&#26469;&#25511;&#21046;&#23376;&#32447;&#31243;&#65292;&#24403;&#25152;&#26377;&#30340;&#23376;&#32447;&#31243;&#20934;&#22791;&#23601;&#32490;&#26102;&#20505;&#65292;&#20027;&#32447;&#31243;&#25191;&#34892;startGate&#30340;countDown&#25805;&#20316;&#65292;&#35753;&#23376;&#32447;&#31243;&#19968;&#36215;&#36816;&#34892;</span>
    <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">CountDownLatch</span> <span style="color: #eedd82;">startGate</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">CountDownLatch</span>(1);
    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">endGate&#29992;&#26469;&#25511;&#21046;&#20027;&#32447;&#31243;&#65292;&#27599;&#20010;&#23376;&#32447;&#31243;&#36816;&#34892;&#23436;&#27605;&#21518;&#65292;&#23545;endGate&#25191;&#34892;countDown&#25805;&#20316;&#65292;&#24403;&#25152;&#26377;&#30340;&#23376;&#32447;&#31243;&#32467;&#26463;&#21518;&#65292;&#20027;&#32447;&#31243;&#24674;&#22797;&#36816;&#34892;</span>
    <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">CountDownLatch</span> <span style="color: #eedd82;">endGate</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">CountDownLatch</span>(nThreads);
    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = 0; i &lt; <span style="color: #98fb98;">nThreads</span>; i++) {
        <span style="color: #98fb98;">Thread</span> <span style="color: #eedd82;">t</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>() {
                <span style="color: #7fffd4;">@Override</span>
                <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
                    <span style="color: #00ffff;">try</span> {
                        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">n&#20010;&#32447;&#31243;&#36890;&#36807;start gate&#22788;&#20110;&#31561;&#24453;&#29366;&#24577;</span>
                        startGate.await();
                        <span style="color: #00ffff;">try</span> {
                            task.run();
                        } <span style="color: #00ffff;">finally</span> {
                            endGate.countDown();
                        }
                    } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">InterruptedException</span> <span style="color: #eedd82;">ignored</span>) {
                    }
                }
            };
        t.start();
    }
    <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">start</span> = System.nanoTime();
    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">start gate&#24320;&#21551;&#65292;n&#20010;&#32447;&#31243;&#21516;&#26102;&#24320;&#22987;&#36816;&#34892;</span>
    startGate.countDown();

    endGate.await();
    <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">end</span> = System.nanoTime();
    <span style="color: #00ffff;">return</span> end - start;
}
</pre>
</div>
</div>
</div>
