src/jcip/build_blocks.org
** FutureTask
   FutureTask用于执行任务, 常用的构造函数为FutureTask(Callable<V> callable), 使用Callable封装任务, 其get方法将返回任务的执行结果 
   
   FutureTask对象具有三种状态: 等待运行, 正在运行, 已完成. 当FutureTask对象处于已完成状态时调用get方法, get方法将立即返回计算结果, 否则get方法会阻塞, 直到FutureTask转变为已完成状态. 计算完成, 抛出异常, 或者被取消都会使得FutureTask的状态变为已完成 
   
   FutureTask的常见使用场景是封装一个耗时任务, 然后提前开始计算, 当需要计算结果时, 再调用其get方法, 这样可以减少等待计算完成的时间
   
   #+BEGIN_SRC java
  public class Preloader {
          private final FutureTask<ProductInfo> future =
                  new FutureTask<ProductInfo>(new Callable<ProductInfo>() {
                                  public ProductInfo call() throws DataLoadException {
                                          return loadProductInfo();
                                  }
                          });
          private final Thread thread = new Thread(future);
          public void start() { thread.start(); }
          public ProductInfo get()
                  throws DataLoadException, InterruptedException {
                  try {
  　　　　　　　　　　　　　　// get可能阻塞，获得计算结果，抛出异常                          
                          return future.get();
                  } catch (ExecutionException e) {
                          Throwable cause = e.getCause();
                          if (cause instanceof DataLoadException)
                                  throw (DataLoadException) cause;
                          else
                                  throw launderThrowable(cause);
                  }
          }
  }
   #+END_SRC
   
   异常处理
1. 业务异常在主线程处理
2. RuntimeException返回，在主线程抛出
3. Error直接抛出
4. 抛出IllegalStateException
   
   #+BEGIN_SRC java
     /** If the Throwable is an Error, throw it; if it is a
      ,* RuntimeException return it, otherwise throw IllegalStateException
      ,*/
     public static RuntimeException launderThrowable(Throwable t) {
             if (t instanceof RuntimeException)
                     return (RuntimeException) t;
             else if (t instanceof Error)
                     throw (Error) t;
             else
                     throw new IllegalStateException("Not unchecked", t);
     }
   #+END_SRC
   
** Semphore
   Semaphore用于管理permit, 创建Semaphore对象时, 需要指定permit的最大个数　
   
   调用acquire()方法申请从Semaphore对象中获取一个permit, 如果当前semaphore对象没有可用的permit, 线程将被阻塞, 直到有可用的permit 
   
   调用release()方法将permit放回Semaphore对象
   
   Permit不与线程绑定, 一个线程申请的permit, 可以在另一个线程里release 
   
   Semaphore通常用于实现资源池,有界的集合，如数据库连接池等   
   #+BEGIN_SRC java
  public class BoundedHashSet<T> {
          private final Set<T> set;
          private final Semaphore sem;

          public BoundedHashSet(int bound) {
                  this.set = Collections.synchronizedSet(new HashSet<>());
                  // 设定Semaphore对象中的permit的最大个数  
                  sem = new Semaphore(bound);
          }

          public boolean add(T o) throws InterruptedException {
                  // 每次add时就向semaphore对象申请一个permit  
                  sem.acquire();
                  boolean wasAdded = false;
                  try {
                          wasAdded = set.add(o);
                          return wasAdded;
                  } finally {
                          if (!wasAdded) {
                                  // set里已经存在元素时候release permit  
                                  sem.release();
                          }
                  }
          }

          public boolean remove(T o) {
                  boolean wasRemoved = set.remove(o);
                  if (wasRemoved) {
                          // 成功移除后将release permit 
                          sem.release();
                  }
                  return wasRemoved;
          }
  }
   #+END_SRC
   
