jcip/html/build_blocks.html
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">FutureTask</h3>
<div class="outline-text-3" id="text-4-2">
<p>
FutureTask用于执行任务, 常用的构造函数为FutureTask(Callable&lt;V&gt; callable), 使用Callable封装任务, 其get方法将返回任务的执行结果 <br  />
   FutureTask对象具有三种状态: 等待运行, 正在运行, 已完成. 当FutureTask对象处于已完成状态时调用get方法, get方法将立即返回计算结果, 否则get方法会阻塞, 直到FutureTask转变为已完成状态. 计算完成, 抛出异常, 或者被取消都会使得FutureTask的状态变为已完成 <br  />
   FutureTask的常见使用场景是封装一个耗时任务, 然后提前开始计算, 当需要计算结果时, 再调用其get方法, 这样可以减少等待计算完成的时间
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Preloader</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">ProductInfo</span>&gt; <span style="color: #eedd82;">future</span> =
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">ProductInfo</span>&gt;(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Callable</span>&lt;<span style="color: #98fb98;">ProductInfo</span>&gt;() {
                <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">ProductInfo</span> <span style="color: #87cefa;">call</span>() <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">DataLoadException</span> {
                    <span style="color: #00ffff;">return</span> loadProductInfo();
                }
            });
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Thread</span> <span style="color: #eedd82;">thread</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(future);
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">start</span>() { thread.start(); }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">ProductInfo</span> <span style="color: #87cefa;">get</span>()
        <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">DataLoadException</span>, <span style="color: #98fb98;">InterruptedException</span> {
        <span style="color: #00ffff;">try</span> {
&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;<span style="color: #ff4500;">// </span><span style="color: #ff4500;">get&#21487;&#33021;&#38459;&#22622;&#65292;&#33719;&#24471;&#35745;&#31639;&#32467;&#26524;&#65292;&#25243;&#20986;&#24322;&#24120;                          </span>
            <span style="color: #00ffff;">return</span> future.get();
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">ExecutionException</span> <span style="color: #eedd82;">e</span>) {
            <span style="color: #98fb98;">Throwable</span> <span style="color: #eedd82;">cause</span> = e.getCause();
            <span style="color: #00ffff;">if</span> (cause <span style="color: #00ffff;">instanceof</span> DataLoadException)
                <span style="color: #00ffff;">throw</span> (<span style="color: #98fb98;">DataLoadException</span>) cause;
            <span style="color: #00ffff;">else</span>
                <span style="color: #00ffff;">throw</span> launderThrowable(cause);
        }
    }
}
</pre>
</div>

<p>
异常处理
</p>
<ol class="org-ol">
<li>业务异常在主线程处理
</li>
<li>RuntimeException返回，在主线程抛出
</li>
<li>Error直接抛出
</li>
<li>抛出IllegalStateException

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ffa07a;">/** If the Throwable is an Error, throw it; if it is a</span>
<span style="color: #ffa07a;"> * RuntimeException return it, otherwise throw IllegalStateException</span>
<span style="color: #ffa07a;"> */</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">RuntimeException</span> <span style="color: #87cefa;">launderThrowable</span>(<span style="color: #98fb98;">Throwable</span> <span style="color: #eedd82;">t</span>) {
    <span style="color: #00ffff;">if</span> (t <span style="color: #00ffff;">instanceof</span> RuntimeException)
        <span style="color: #00ffff;">return</span> (<span style="color: #98fb98;">RuntimeException</span>) t;
    <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span> (t <span style="color: #00ffff;">instanceof</span> Error)
        <span style="color: #00ffff;">throw</span> (<span style="color: #98fb98;">Error</span>) t;
    <span style="color: #00ffff;">else</span>
        <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IllegalStateException</span>(<span style="color: #ffa07a;">"Not unchecked"</span>, t);
}
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Semphore</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Semaphore用于管理permit, 创建Semaphore对象时, 需要指定permit的最大个数　<br  />
   调用acquire()方法申请从Semaphore对象中获取一个permit, 如果当前semaphore对象没有可用的permit, 线程将被阻塞, 直到有可用的permit <br  />
   调用release()方法将permit放回Semaphore对象. <br  />
   Permit不与线程绑定, 一个线程申请的permit, 可以在另一个线程里release <br  />
   Semaphore通常用于实现资源池,有界的集合，如数据库连接池等
</p>


<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">BoundedHashSet</span>&lt;<span style="color: #98fb98;">T</span>&gt; {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Set</span>&lt;<span style="color: #98fb98;">T</span>&gt; <span style="color: #eedd82;">set</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Semaphore</span> <span style="color: #eedd82;">sem</span>;

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">BoundedHashSet</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">bound</span>) {
        <span style="color: #00ffff;">this</span>.set = Collections.synchronizedSet(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashSet</span>&lt;&gt;());
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#35774;&#23450;Semaphore&#23545;&#35937;&#20013;&#30340;permit&#30340;&#26368;&#22823;&#20010;&#25968;  </span>
        sem = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Semaphore</span>(bound);
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">add</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">o</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#27599;&#27425;add&#26102;&#23601;&#21521;semaphore&#23545;&#35937;&#30003;&#35831;&#19968;&#20010;permit  </span>
        sem.acquire();
        <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">wasAdded</span> = <span style="color: #7fffd4;">false</span>;
        <span style="color: #00ffff;">try</span> {
            wasAdded = set.add(o);
            <span style="color: #00ffff;">return</span> wasAdded;
        } <span style="color: #00ffff;">finally</span> {
            <span style="color: #00ffff;">if</span> (!wasAdded) {
                <span style="color: #ff4500;">// </span><span style="color: #ff4500;">set&#37324;&#24050;&#32463;&#23384;&#22312;&#20803;&#32032;&#26102;&#20505;release permit  </span>
                sem.release();
            }
        }
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">remove</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">o</span>) {
        <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">wasRemoved</span> = set.remove(o);
        <span style="color: #00ffff;">if</span> (wasRemoved) {
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#25104;&#21151;&#31227;&#38500;&#21518;&#23558;release permit </span>
            sem.release();
        }
        <span style="color: #00ffff;">return</span> wasRemoved;
    }
}
</pre>
</div>
</div>
</div>
