src/jcip/build_blocks.org
** 栅栏
   栅栏允许一组线程互相等待, 直到该组线程全部到达某个公共屏障点, 闭锁是一组线程等待事件，而栅栏是一组线程互相等待其他线程　
   
   CyclicBarrier是栅栏的一种实现，创建CyclicBarrier时需要指定线程组中线程的数量
   
   调用CyclicBarrier对象的await方法, 表示当前线程已到达公共屏障点, 然后等待其他线程到达。当所有线程到达公共屏障点后, CyclicBarrier对象将释放线程组, 然后重置CyclicBarrier对象的状态. 因此CyclicBarrier对象是可以循环使用的, 反之闭锁的门一旦打开就不会再次关闭。如果有线程在等待期间超时或者被中断, 该CyclicBarrier对象被视为已损坏, 随后对await方法的调用都要抛出BrokenBarrierException异常
   
   栅栏可以用于计算中主线程等待另外一组线程并行计算完毕　
   #+BEGIN_SRC java
  public class CellularAutomata {
          private final Board mainBoard;
          private final CyclicBarrier barrier;
          private final Worker[] workers;
          public CellularAutomata(Board board) {
                  this.mainBoard = board;
                  int count = Runtime.getRuntime().availableProcessors();
                  this.barrier = new CyclicBarrier(count,
                                                   new Runnable() {
                                                           public void run() {
                                                                   mainBoard.commitNewValues();
                                                           }});
                  this.workers = new Worker[count];
                  for (int i = 0; i < count; i++)
                          workers[i] = new Worker(mainBoard.getSubBoard(count, i));
          }
          private class Worker implements Runnable {
                  private final Board board;
                  public Worker(Board board) { this.board = board; }
                  public void run() {
                          while (!board.hasConverged()) {
                                  for (int x = 0; x < board.getMaxX(); x++)
                                          for (int y = 0; y < board.getMaxY(); y++)
                                                  board.setNewValue(x, y, computeValue(x, y));
                                  try {
                                          barrier.await();
                                  } catch (InterruptedException ex) {
                                          return;
                                  } catch (BrokenBarrierException ex) {
                                          return;
                                  }
                          }
                  }
          }
          public void start() {
                  for (int i = 0; i < workers.length; i++)
                          new Thread(workers[i]).start();
                  mainBoard.waitForConvergence();
          }
  }
   #+END_SRC
   　
* 高效线程安全的缓存
** 使用HashMap做缓存
   #+BEGIN_SRC java
     public interface Computable<A, V> {   
             V compute(A arg) throws InterruptedException;   
     }   
       
     public class ExpensiveFunction   
             implements Computable<String, BigInteger> {   
             // 模拟一个耗时操作  
             public BigInteger compute(String arg) {   
                     // ...  
                     return new BigInteger(arg);   
             }   
     }   
       
     public class Memorizer1<A, V> implements Computable<A, V> {   
             private final Map<A, V> cache = new HashMap<A, V>();   
             private final Computable<A, V> c;   
       
             public Memorizer1(Computable<A, V> c) {   
                     this.c = c;   
             }   
             // 使用synchronized同步整个方法解决线程安全  
             public synchronized V compute(A arg) throws InterruptedException {   
                     V result = cache.get(arg);   
                     if (result == null) {   
                             result = c.compute(arg);   
                             cache.put(arg, result);   
                     }   
                     return result;   
             }   
     }  
   #+END_SRC
   由于HashMap不是线程安全的, Memorizer1同步整个compute方法, 避免重复计算的同时, 牺牲了并发执行compute方法的机会, 此种设计甚至可能导致性能比没有缓存更差 
