jcip/html/build_blocks.html

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">栅栏</h3>
<div class="outline-text-3" id="text-4-4">
<p>
栅栏允许一组线程互相等待, 直到该组线程全部到达某个公共屏障点　<br  />
   闭锁是一组线程等待事件，而栅栏是一组线程互相等待其他线程　<br  />
</p>

<p>
CyclicBarrier是栅栏的一种实现，创建CyclicBarrier时需要指定线程组中线程的数量 <br  />
   调用CyclicBarrier对象的await方法, 表示当前线程已到达公共屏障点, 然后等待其他线程到达　<br  />
   当所有线程到达公共屏障点后, CyclicBarrier对象将释放线程组, 然后重置CyclicBarrier对象的状态. 因此CyclicBarrier对象是可以循环使用的, 反之闭锁的门一旦打开就不会再次关闭 <br  />
   如果有线程在等待期间超时或者被中断, 该CyclicBarrier对象被视为已损坏, 随后对await方法的调用都要抛出BrokenBarrierException异常
</p>

<p>
栅栏可以用于计算中主线程等待另外一组线程并行计算完毕　
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">CellularAutomata</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Board</span> <span style="color: #eedd82;">mainBoard</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">CyclicBarrier</span> <span style="color: #eedd82;">barrier</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Worker</span>[] <span style="color: #eedd82;">workers</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">CellularAutomata</span>(<span style="color: #98fb98;">Board</span> <span style="color: #eedd82;">board</span>) {
        <span style="color: #00ffff;">this</span>.mainBoard = board;
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">count</span> = Runtime.getRuntime().availableProcessors();
        <span style="color: #00ffff;">this</span>.barrier = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">CyclicBarrier</span>(count,
                         <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Runnable</span>() {
                             <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
                                 mainBoard.commitNewValues();
                             }});
        <span style="color: #00ffff;">this</span>.workers = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Worker</span>[count];
        <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = 0; i &lt; <span style="color: #98fb98;">count</span>; i++)
            workers[i] = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Worker</span>(mainBoard.getSubBoard(count, i));
    }
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Worker</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Runnable</span> {
        <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Board</span> <span style="color: #eedd82;">board</span>;
        <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Worker</span>(<span style="color: #98fb98;">Board</span> <span style="color: #eedd82;">board</span>) { <span style="color: #00ffff;">this</span>.board = board; }
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
            <span style="color: #00ffff;">while</span> (!board.hasConverged()) {
                <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">x</span> = 0; x &lt; board.<span style="color: #98fb98;">getMaxX</span>(); x++)
                    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">y</span> = 0; y &lt; board.<span style="color: #98fb98;">getMaxY</span>(); y++)
                        board.setNewValue(x, y, computeValue(x, y));
                <span style="color: #00ffff;">try</span> {
                    barrier.await();
                } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">InterruptedException</span> <span style="color: #eedd82;">ex</span>) {
                    <span style="color: #00ffff;">return</span>;
                } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">BrokenBarrierException</span> <span style="color: #eedd82;">ex</span>) {
                    <span style="color: #00ffff;">return</span>;
                }
            }
        }
    }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">start</span>() {
        <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = 0; i &lt; workers.<span style="color: #98fb98;">length</span>; i++)
            <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(workers[i]).start();
        mainBoard.waitForConvergence();
    }
}
</pre>
</div>
<p>
　
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">高效线程安全的缓存</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">使用HashMap做缓存</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">interface</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; {   
    <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">compute</span>(<span style="color: #98fb98;">A</span> <span style="color: #eedd82;">arg</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span>;   
}   

<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ExpensiveFunction</span>   
    <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">String</span>, <span style="color: #98fb98;">BigInteger</span>&gt; {   
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#27169;&#25311;&#19968;&#20010;&#32791;&#26102;&#25805;&#20316;  </span>
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">BigInteger</span> <span style="color: #87cefa;">compute</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">arg</span>) {   
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">...  </span>
        <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">BigInteger</span>(arg);   
    }   
}   

<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Memorizer1</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; {   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Map</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">cache</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashMap</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt;();   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>;   

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Memorizer1</span>(<span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>) {   
        <span style="color: #00ffff;">this</span>.c = c;   
    }   
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#20351;&#29992;synchronized&#21516;&#27493;&#25972;&#20010;&#26041;&#27861;&#35299;&#20915;&#32447;&#31243;&#23433;&#20840;  </span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">synchronized</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">compute</span>(<span style="color: #98fb98;">A</span> <span style="color: #eedd82;">arg</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
        <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">result</span> = cache.get(arg);   
        <span style="color: #00ffff;">if</span> (result == <span style="color: #7fffd4;">null</span>) {   
            result = c.compute(arg);   
            cache.put(arg, result);   
        }   
        <span style="color: #00ffff;">return</span> result;   
    }   
}
</pre>
</div>
<p>
由于HashMap不是线程安全的, Memorizer1同步整个compute方法, 避免重复计算的同时, 牺牲了并发执行compute方法的机会, 此种设计甚至可能导致性能比没有缓存更差 
</p>
</div>
</div>
