src/jcip/build_blocks.org
** 使用ConcurrentHashMap避免加锁　
   
   #+BEGIN_SRC java
     public class Memorizer2<A, V> implements Computable<A, V> {   
             private final Map<A, V> cache = new ConcurrentHashMap<A, V>();   
             private final Computable<A, V> c;   
       
             public Memorizer2(Computable<A, V> c) { this.c = c; }   
       
             public V compute(A arg) throws InterruptedException {   
                     V result = cache.get(arg);   
                     if (result == null) {   
                             result = c.compute(arg);   
                             cache.put(arg, result);   
                     }   
                     return result;   
             }   
     }   
   #+END_SRC
   Memorizer2的问题在于一个线程在执行compute方法的过程中, 其他线程以相同的参数调用compute方法时, 无法从缓存中获知已有线程正在进行该参数的计算的信息, 因此造成了重复计算的发生 
** 缓存Future对象，返回该Future对象的get方法，如果实际的计算还在进行当中, get方法将被阻塞, 直到计算完成　
   
   #+BEGIN_SRC java
     public class Memorizer3<A, V> implements Computable<A, V> {   
             // 改为缓存Future  
             private final Map<A, Future<V>> cache   
             = new ConcurrentHashMap<A, Future<V>>();   
             private final Computable<A, V> c;   
       
             public Memorizer3(Computable<A, V> c) { this.c = c; }   
       
             public V compute(final A arg) throws InterruptedException {   
                     Future<V> f = cache.get(arg);   
                     if (f == null) {   
                             Callable<V> eval = new Callable<V>() {   
                                             public V call() throws InterruptedException {   
                                                     return c.compute(arg);   
                                             }   
                                     };   
                             FutureTask<V> ft = new FutureTask<V>(eval);   
                             f = ft;   
                             // 在计算开始前就将Future对象存入缓存中.  
                             cache.put(arg, ft);   
                             ft.run(); // call to c.compute happens here   
                     }   
                     try {   
                             // 如果缓存中存在arg对应的Future对象, 就直接调用该Future对象的get方法.  
                             // 如果实际的计算还在进行当中, get方法将被阻塞, 直到计算完成  
                             return f.get();   
                     } catch (ExecutionException e) {   
                             throw launderThrowable(e.getCause());   
                     }   
             }   
     }   
   #+END_SRC
   不幸的是Memorizer3仍然存在重复计算的问题, 只是相对于Memorizer2重复计算的概率降低了一些. get, if, put这三个操作并不是原子性的　
   
