jcip/html/build_blocks.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">使用ConcurrentHashMap避免加锁　</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Memorizer2</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; {   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Map</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">cache</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ConcurrentHashMap</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt;();   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>;   

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Memorizer2</span>(<span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>) { <span style="color: #00ffff;">this</span>.c = c; }   

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">compute</span>(<span style="color: #98fb98;">A</span> <span style="color: #eedd82;">arg</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
        <span style="color: #98fb98;">V</span> <span style="color: #eedd82;">result</span> = cache.get(arg);   
        <span style="color: #00ffff;">if</span> (result == <span style="color: #7fffd4;">null</span>) {   
            result = c.compute(arg);   
            cache.put(arg, result);   
        }   
        <span style="color: #00ffff;">return</span> result;   
    }   
}
</pre>
</div>
<p>
Memorizer2的问题在于一个线程在执行compute方法的过程中, 其他线程以相同的参数调用compute方法时, 无法从缓存中获知已有线程正在进行该参数的计算的信息, 因此造成了重复计算的发生 
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">缓存Future对象，返回该Future对象的get方法，如果实际的计算还在进行当中, get方法将被阻塞, 直到计算完成　</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Memorizer3</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; {   
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#25913;&#20026;&#32531;&#23384;Future  </span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Map</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt;&gt; <span style="color: #eedd82;">cache</span>   
    = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ConcurrentHashMap</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt;&gt;();   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>;   

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Memorizer3</span>(<span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>) { <span style="color: #00ffff;">this</span>.c = c; }   

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">compute</span>(<span style="color: #00ffff;">final</span> <span style="color: #98fb98;">A</span> <span style="color: #eedd82;">arg</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
        <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">f</span> = cache.get(arg);   
        <span style="color: #00ffff;">if</span> (f == <span style="color: #7fffd4;">null</span>) {   
            <span style="color: #98fb98;">Callable</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">eval</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Callable</span>&lt;<span style="color: #98fb98;">V</span>&gt;() {   
                    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">call</span>() <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
                        <span style="color: #00ffff;">return</span> c.compute(arg);   
                    }   
                };   
            <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">ft</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">V</span>&gt;(eval);   
            f = ft;   
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22312;&#35745;&#31639;&#24320;&#22987;&#21069;&#23601;&#23558;Future&#23545;&#35937;&#23384;&#20837;&#32531;&#23384;&#20013;.  </span>
            cache.put(arg, ft);   
            ft.run(); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">call to c.compute happens here   </span>
        }   
        <span style="color: #00ffff;">try</span> {   
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22914;&#26524;&#32531;&#23384;&#20013;&#23384;&#22312;arg&#23545;&#24212;&#30340;Future&#23545;&#35937;, &#23601;&#30452;&#25509;&#35843;&#29992;&#35813;Future&#23545;&#35937;&#30340;get&#26041;&#27861;.  </span>
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22914;&#26524;&#23454;&#38469;&#30340;&#35745;&#31639;&#36824;&#22312;&#36827;&#34892;&#24403;&#20013;, get&#26041;&#27861;&#23558;&#34987;&#38459;&#22622;, &#30452;&#21040;&#35745;&#31639;&#23436;&#25104;  </span>
            <span style="color: #00ffff;">return</span> f.get();   
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">ExecutionException</span> <span style="color: #eedd82;">e</span>) {   
            <span style="color: #00ffff;">throw</span> launderThrowable(e.getCause());   
        }   
    }   
}
</pre>
</div>
<p>
不幸的是Memorizer3仍然存在重复计算的问题, 只是相对于Memorizer2重复计算的概率降低了一些. get, if, put这三个操作并不是原子性的　
</p>
</div>
</div>
