src/jcip/build_blocks.org
** 使用putIfAbsent合并get,if,put这三个操作 
   #+BEGIN_SRC java
  public class Memorizer<A, V> implements Computable<A, V> {   
          private final ConcurrentMap<A, Future<V>> cache   
          = new ConcurrentHashMap<A, Future<V>>();   
          private final Computable<A, V> c;   
    
          public Memorizer(Computable<A, V> c) { this.c = c; }   
    
          public V compute(final A arg) throws InterruptedException {   
                  while (true) {   
                          Future<V> f = cache.get(arg);   
                          if (f == null) {   
                                  Callable<V> eval = new Callable<V>() {   
                                                  public V call() throws InterruptedException {   
                                                          return c.compute(arg);   
                                                  }   
                                          };   
                                  FutureTask<V> ft = new FutureTask<V>(eval);   
                                  // 使用putIfAbsent测试是否真的将ft存入了缓存, 如果存入失败, 说明cache中已经存在arg对应的future对象  
                                  // 否则才进行计算.  
                                  f = cache.putIfAbsent(arg, ft);   
                                  if (f == null) { f = ft; ft.run(); }   
                          }   
                          try {   
                                  return f.get();   
                          } catch (CancellationException e) {   
                                  // 当计算被取消时, 从缓存中移除arg-f键值对  
                                  cache.remove(arg, f);   
                          } catch (ExecutionException e) {   
                                  throw launderThrowable(e.getCause());   
                          }   
                  }   
          }   
  }   
   #+END_SRC
   
[[file:executor.org][Next:任务执行]] [[file:composing_objects.org][Previous:对象组合]] [[file:jcip.org][Up:目录]]
