jcip/html/build_blocks.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">使用putIfAbsent合并get,if,put这三个操作</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Memorizer</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; {   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">ConcurrentMap</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt;&gt; <span style="color: #eedd82;">cache</span>   
    = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ConcurrentHashMap</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt;&gt;();   
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>;   

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Memorizer</span>(<span style="color: #98fb98;">Computable</span>&lt;<span style="color: #98fb98;">A</span>, <span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">c</span>) { <span style="color: #00ffff;">this</span>.c = c; }   

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">compute</span>(<span style="color: #00ffff;">final</span> <span style="color: #98fb98;">A</span> <span style="color: #eedd82;">arg</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
        <span style="color: #00ffff;">while</span> (<span style="color: #7fffd4;">true</span>) {   
            <span style="color: #98fb98;">Future</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">f</span> = cache.get(arg);   
            <span style="color: #00ffff;">if</span> (f == <span style="color: #7fffd4;">null</span>) {   
                <span style="color: #98fb98;">Callable</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">eval</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Callable</span>&lt;<span style="color: #98fb98;">V</span>&gt;() {   
                        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">V</span> <span style="color: #87cefa;">call</span>() <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">InterruptedException</span> {   
                            <span style="color: #00ffff;">return</span> c.compute(arg);   
                        }   
                    };   
                <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">V</span>&gt; <span style="color: #eedd82;">ft</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">FutureTask</span>&lt;<span style="color: #98fb98;">V</span>&gt;(eval);   
                <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#20351;&#29992;putIfAbsent&#27979;&#35797;&#26159;&#21542;&#30495;&#30340;&#23558;ft&#23384;&#20837;&#20102;&#32531;&#23384;, &#22914;&#26524;&#23384;&#20837;&#22833;&#36133;, &#35828;&#26126;cache&#20013;&#24050;&#32463;&#23384;&#22312;arg&#23545;&#24212;&#30340;future&#23545;&#35937;  </span>
                <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#21542;&#21017;&#25165;&#36827;&#34892;&#35745;&#31639;.  </span>
                f = cache.putIfAbsent(arg, ft);   
                <span style="color: #00ffff;">if</span> (f == <span style="color: #7fffd4;">null</span>) { f = ft; ft.run(); }   
            }   
            <span style="color: #00ffff;">try</span> {   
                <span style="color: #00ffff;">return</span> f.get();   
            } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">CancellationException</span> <span style="color: #eedd82;">e</span>) {   
                <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#24403;&#35745;&#31639;&#34987;&#21462;&#28040;&#26102;, &#20174;&#32531;&#23384;&#20013;&#31227;&#38500;arg-f&#38190;&#20540;&#23545;  </span>
                cache.remove(arg, f);   
            } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">ExecutionException</span> <span style="color: #eedd82;">e</span>) {   
                <span style="color: #00ffff;">throw</span> launderThrowable(e.getCause());   
            }   
        }   
    }   
}
</pre>
</div>

<p>
<a href="executor.html">Next:任务执行</a> <a href="composing_objects.html">Previous:对象组合</a> <a href="jcip.html">Up:目录</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: klose</p>
<p class="date">Created: 2016-11-13 Sun 23:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
